In [1]:
# Importing dependencies
import pandas as pd

In [2]:
# Reading the dataframes
child_mortality = pd.read_csv('Dataset/healthdata/child-mortality.csv')
hiv_deaths = pd.read_csv('Dataset/healthdata/deaths-and-new-cases-of-hiv.csv')
life_expectency = pd.read_csv('Dataset/healthdata/life-expectancy.csv')
population = pd.read_csv('Dataset/healthdata/projected-population-by-country.csv')
heart_disease = pd.read_csv('Dataset/healthdata/share-deaths-heart-disease.csv')
tuberculosis = pd.read_csv('Dataset/healthdata/tuberculosis-deaths-region.csv')

# Cleaning up the dataset

In [3]:
# Child mortality rates
child_mortality1 = child_mortality['Year'].max()
child_mortality1

2016

In [4]:
child_mortality2 = child_mortality[child_mortality['Year']==2016]
child_mortality2

               Entity Code  Year  Child mortality rates (%)
59        Afghanistan  AFG  2016                     7.0400
98            Albania  ALB  2016                     1.3500
161           Algeria  DZA  2016                     2.5200
188           Andorra  AND  2016                     0.2700
225            Angola  AGO  2016                     8.2500
...               ...  ...   ...                        ...
13314         Vietnam  VNM  2016                     2.1600
13317  Western Sahara  ESH  2016                     3.6388
13382           Yemen  YEM  2016                     5.5300
13447          Zambia  ZMB  2016                     6.3400
13511        Zimbabwe  ZWE  2016                     5.6400

[211 rows x 4 columns]

In [5]:
# Hiv Deaths
hiv_deaths.columns

Index(['Entity', 'Code', 'Year', 'Deaths', 'Prevalence', 'Incidences'], dtype='object')

In [6]:
hiv_deaths.head()

        Entity Code  Year     Deaths  Prevalence  Incidences
0  Afghanistan  AFG  1990  32.098129  398.257783   78.304642
1  Afghanistan  AFG  1991  37.524158  438.019845   83.233703
2  Afghanistan  AFG  1992  50.670559  543.250161  104.710195
3  Afghanistan  AFG  1993  58.433049  668.869833  128.605343
4  Afghanistan  AFG  1994  65.531176  735.565331  136.848748

In [7]:
# Obtaining the latest year
hiv_deaths['Year'].max()

2017

In [8]:
hiv_deaths1 = hiv_deaths[hiv_deaths['Year']==2017]
hiv_deaths1

,Entity,Code,Year,Deaths,Prevalence,Incidences
27,Afghanistan,AFG,2017,302.166880,4.730034e+03,9.221735e+02
55,Albania,ALB,2017,1.285800,3.187413e+01,3.030192e+00
83,Algeria,DZA,2017,326.660742,1.125392e+04,9.008058e+02
111,American Samoa,ASM,2017,0.335763,4.887205e+00,6.577304e-01
139,Andean Latin America,NaN,2017,4655.939469,1.388683e+05,1.238097e+04
...,...,...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,256899.798300,5.852181e+06,3.604100e+05
6383,World,OWID_WRL,2017,954491.747200,3.682224e+07,1.942071e+06
6411,Yemen,YEM,2017,387.383175,6.962759e+03,1.082583e+03
6439,Zambia,ZMB,2017,21806.824350,1.200474e+06,4.683891e+04
6467,Zimbabwe,ZWE,2017,16065.329680,1.297676e+06,5.625906e+04

In [9]:
hiv_deaths2 = hiv_deaths1.rename(columns={'Deaths':'HIV Deaths', 'Incidences':'HIV Incidences'})
hiv_deaths2

,Entity,Code,Year,HIV Deaths,Prevalence,HIV Incidences
27,Afghanistan,AFG,2017,302.166880,4.730034e+03,9.221735e+02
55,Albania,ALB,2017,1.285800,3.187413e+01,3.030192e+00
83,Algeria,DZA,2017,326.660742,1.125392e+04,9.008058e+02
111,American Samoa,ASM,2017,0.335763,4.887205e+00,6.577304e-01
139,Andean Latin America,NaN,2017,4655.939469,1.388683e+05,1.238097e+04
...,...,...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,256899.798300,5.852181e+06,3.604100e+05
6383,World,OWID_WRL,2017,954491.747200,3.682224e+07,1.942071e+06
6411,Yemen,YEM,2017,387.383175,6.962759e+03,1.082583e+03
6439,Zambia,ZMB,2017,21806.824350,1.200474e+06,4.683891e+04
6467,Zimbabwe,ZWE,2017,16065.329680,1.297676e+06,5.625906e+04

In [10]:
# Dropping Columns
hiv_deaths3 = hiv_deaths2.drop(columns=['Prevalence','Code','Year'])
hiv_deaths3

                          Entity     HIV Deaths  HIV Incidences
27                   Afghanistan     302.166880    9.221735e+02
55                       Albania       1.285800    3.030192e+00
83                       Algeria     326.660742    9.008058e+02
111               American Samoa       0.335763    6.577304e-01
139         Andean Latin America    4655.939469    1.238097e+04
...                          ...            ...             ...
6355  Western Sub-Saharan Africa  256899.798300    3.604100e+05
6383                       World  954491.747200    1.942071e+06
6411                       Yemen     387.383175    1.082583e+03
6439                      Zambia   21806.824350    4.683891e+04
6467                    Zimbabwe   16065.329680    5.625906e+04

[231 rows x 3 columns]

In [11]:
# Life Expectency
life_expectency.head()

        Entity Code  Year  Life expectancy
0  Afghanistan  AFG  1950           27.638
1  Afghanistan  AFG  1951           27.878
2  Afghanistan  AFG  1952           28.361
3  Afghanistan  AFG  1953           28.852
4  Afghanistan  AFG  1954           29.350

In [12]:
life_expectency['Year'].max()

2019

In [13]:
# Obtaining the latest data
life_expectency1 = life_expectency[life_expectency['Year']==2019]
life_expectency1

               Entity      Code  Year  Life expectancy
69        Afghanistan       AFG  2019           64.833
141            Africa       NaN  2019           63.170
211           Albania       ALB  2019           78.573
284           Algeria       DZA  2019           76.880
354    American Samoa       ASM  2019           73.745
...               ...       ...   ...              ...
18740  Western Sahara       ESH  2019           70.263
18817           World  OWID_WRL  2019           72.584
18887           Yemen       YEM  2019           66.125
18957          Zambia       ZMB  2019           63.886
19027        Zimbabwe       ZWE  2019           61.490

[243 rows x 4 columns]

In [14]:
life_expectency2 = life_expectency1.drop(columns=['Code', 'Year'])
life_expectency2

               Entity  Life expectancy
69        Afghanistan           64.833
141            Africa           63.170
211           Albania           78.573
284           Algeria           76.880
354    American Samoa           73.745
...               ...              ...
18740  Western Sahara           70.263
18817           World           72.584
18887           Yemen           66.125
18957          Zambia           63.886
19027        Zimbabwe           61.490

[243 rows x 2 columns]

In [15]:
# Population Data by Country
population

,Entity,Code,Year,"Population by country and region, historic and projections (Gapminder, HYDE & UN)"
0,Afghanistan,AFG,1800,3280000
1,Afghanistan,AFG,1801,3280000
2,Afghanistan,AFG,1802,3280000
3,Afghanistan,AFG,1803,3280000
4,Afghanistan,AFG,1804,3280000
...,...,...,...,...
66480,Zimbabwe,ZWE,2096,30941000
66481,Zimbabwe,ZWE,2097,30952000
66482,Zimbabwe,ZWE,2098,30960000
66483,Zimbabwe,ZWE,2099,30964000
66484,Zimbabwe,ZWE,2100,30965000

In [16]:
# Latest year
population['Year'].max()

2100

In [17]:
# Obtaining Population as of 2019
population1 = population[population['Year']==2019]
population1

,Entity,Code,Year,"Population by country and region, historic and projections (Gapminder, HYDE & UN)"
219,Afghanistan,AFG,2019,38042000
422,Africa,NaN,2019,1308064000
723,Albania,ALB,2019,2881000
1024,Algeria,DZA,2019,43053000
1175,American Samoa,ASM,2019,55000
...,...,...,...,...
65268,Western Sahara,ESH,2019,582000
65500,World,OWID_WRL,2019,7713468000
65801,Yemen,YEM,2019,29162000
66102,Zambia,ZMB,2019,17861000
66403,Zimbabwe,ZWE,2019,14645000

In [18]:
# Renaming the column
population2 = population1.rename(columns={'Population by country and region, historic and projections (Gapminder, HYDE & UN)': 'Population'})
population2

               Entity      Code  Year  Population
219       Afghanistan       AFG  2019    38042000
422            Africa       NaN  2019  1308064000
723           Albania       ALB  2019     2881000
1024          Algeria       DZA  2019    43053000
1175   American Samoa       ASM  2019       55000
...               ...       ...   ...         ...
65268  Western Sahara       ESH  2019      582000
65500           World  OWID_WRL  2019  7713468000
65801           Yemen       YEM  2019    29162000
66102          Zambia       ZMB  2019    17861000
66403        Zimbabwe       ZWE  2019    14645000

[242 rows x 4 columns]

In [19]:
# Dropping the year and code
population3 = population2.drop(columns=['Year', 'Code'])
population3

               Entity  Population
219       Afghanistan    38042000
422            Africa  1308064000
723           Albania     2881000
1024          Algeria    43053000
1175   American Samoa       55000
...               ...         ...
65268  Western Sahara      582000
65500           World  7713468000
65801           Yemen    29162000
66102          Zambia    17861000
66403        Zimbabwe    14645000

[242 rows x 2 columns]

In [20]:
# Heart Disease Data cleaning
heart_disease.head()

,Entity,Code,Year,Deaths - Cardiovascular diseases - Sex: Both - Age: All Ages (Percent)
0,Afghanistan,AFG,1990,23.707752
1,Afghanistan,AFG,1991,23.490307
2,Afghanistan,AFG,1992,23.146918
3,Afghanistan,AFG,1993,21.154207
4,Afghanistan,AFG,1994,19.756144

In [21]:
heart_disease['Year'].max()

2017

In [22]:
heart_disease1 = heart_disease[heart_disease['Year']==2017]
heart_disease1

,Entity,Code,Year,Deaths - Cardiovascular diseases - Sex: Both - Age: All Ages (Percent)
27,Afghanistan,AFG,2017,24.780577
55,Albania,ALB,2017,55.822085
83,Algeria,DZA,2017,47.284557
111,American Samoa,ASM,2017,30.440218
139,Andean Latin America,NaN,2017,21.193030
...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,10.304049
6383,World,OWID_WRL,2017,31.800515
6411,Yemen,YEM,2017,32.373980
6439,Zambia,ZMB,2017,10.277008
6467,Zimbabwe,ZWE,2017,14.430736

In [23]:
heart_disease2 = heart_disease1.drop(columns=['Year', 'Code']).rename(columns={'Deaths - Cardiovascular diseases - Sex: Both - Age: All Ages (Percent)':'Cardiovascular Deaths %'})
heart_disease2

                          Entity  Cardiovascular Deaths %
27                   Afghanistan                24.780577
55                       Albania                55.822085
83                       Algeria                47.284557
111               American Samoa                30.440218
139         Andean Latin America                21.193030
...                          ...                      ...
6355  Western Sub-Saharan Africa                10.304049
6383                       World                31.800515
6411                       Yemen                32.373980
6439                      Zambia                10.277008
6467                    Zimbabwe                14.430736

[231 rows x 2 columns]

In [24]:
# Tuberculosis Data
tuberculosis.head()

,Entity,Code,Year,Deaths - Tuberculosis - Sex: Both - Age: All Ages (Number)
0,Afghanistan,AFG,1990,4332.690583
1,Afghanistan,AFG,1991,4288.640464
2,Afghanistan,AFG,1992,4475.257542
3,Afghanistan,AFG,1993,4909.050325
4,Afghanistan,AFG,1994,5352.634058

In [25]:
# Latest year
tuberculosis['Year'].max()

2017

In [27]:
# Filtering based on latest year
tuberculosis1 = tuberculosis[tuberculosis['Year']==2017]
tuberculosis1

,Entity,Code,Year,Deaths - Tuberculosis - Sex: Both - Age: All Ages (Number)
27,Afghanistan,AFG,2017,3.634061e+03
55,Albania,ALB,2017,1.198700e+01
83,Algeria,DZA,2017,4.170693e+02
111,American Samoa,ASM,2017,3.769006e-01
139,Andean Latin America,NaN,2017,3.884472e+03
...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,1.297312e+05
6383,World,OWID_WRL,2017,1.183672e+06
6411,Yemen,YEM,2017,1.021099e+03
6439,Zambia,ZMB,2017,8.306847e+03
6467,Zimbabwe,ZWE,2017,1.195807e+04

In [29]:
# Dropping and renaming the column
tuberculosis2 = tuberculosis1.drop(columns=['Code', 'Year']).rename(columns={'Deaths - Tuberculosis - Sex: Both - Age: All Ages (Number)':'TB Deaths'})
tuberculosis2

                          Entity     TB Deaths
27                   Afghanistan  3.634061e+03
55                       Albania  1.198700e+01
83                       Algeria  4.170693e+02
111               American Samoa  3.769006e-01
139         Andean Latin America  3.884472e+03
...                          ...           ...
6355  Western Sub-Saharan Africa  1.297312e+05
6383                       World  1.183672e+06
6411                       Yemen  1.021099e+03
6439                      Zambia  8.306847e+03
6467                    Zimbabwe  1.195807e+04

[231 rows x 2 columns]

In [30]:
# Creating a single CSV File for later visualisation
merged_df = pd.merge(child_mortality2,hiv_deaths3, on='Entity', how='inner')
merged_df

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458
1,Albania,ALB,2016,1.35,1.285800,3.030192
2,Algeria,DZA,2016,2.52,326.660742,900.805751
3,Andorra,AND,2016,0.27,0.441990,4.594938
4,Angola,AGO,2016,8.25,14584.702430,19017.694410
...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980
187,Yemen,YEM,2016,5.53,387.383175,1082.582833
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940

In [31]:
# Merging with Life Expectency Dataframe
merged_df1 = pd.merge(merged_df, life_expectency2, how='inner', on='Entity')
merged_df1

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147
...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490

In [32]:
# Merging with population
merged_df2 = pd.merge(merged_df1,population3, how='inner', on='Entity')
merged_df2

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000
...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000

In [33]:
# Merging with Heart Disease
merged_df3 = pd.merge(merged_df2, heart_disease2, on='Entity', how='inner')
merged_df3

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254
...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736

In [34]:
# Merging with the TB Data
merged_df4 = pd.merge(merged_df3, tuberculosis2, how='inner', on='Entity')
merged_df4

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530
...,...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530

In [36]:
# Converting percentages to absolute numbers
# HIV Deaths and Incidences, and TB deaths are numbers per 100,000. These will be converted to percentages of population

merged_df4['TB Deaths (%)'] = ((merged_df4['TB Deaths']/merged_df4['Population']))*100
merged_df4

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,TB Deaths (%)
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,0.009553
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,0.000416
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,0.000969
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,0.000464
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,0.035850
...,...,...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,0.002759
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,0.018240
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,0.003501
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,0.046508
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,0.081653